In [ ]:
# 어떤 메소드 있는지 정리 하면서 공부

1.결측치 누락치 처리  
5장  
df.mean(axis='columns', skipna=False) NaN을 제외하고 계산  
df1.reindex(columns = df2.columns, fill_value=0)로 nan값을 0으로 바꿔준다.  
7장  


-- nan값 찾기 --   
1) isna(), isnull() : nan값이 있으면 true. data[data.isna()]로 출력도 가능  
2) dropna() : nan만 제외하고 출력. how='' 옵션도 있음. thresh : nan제외 값이 몇 이상 출력  
3) notna(), notnull() : nan값없는거만 true  

-- nan값 처리하기 --  
1) fillna() : nan 값을 채운다. 열에따라 다르게 기입도 가능. ffill가능
2) reindex(method='ffill' or 'bfill')
3)

2. 중복 데이터 처리  
duplicated : bool로 해당값이 중복인지 알려줌.  
drop_duplicates : 중복 아닌값만 출력.

3. 자료형 변경  
- 선언시 dtype=pd.Int64Dtype() 
- 중간변경 : df["B"] = df["B"].astype("string")

4. 문자열 메소드
- split : 분리
- 공백제거 : strip lstrip, rstrip
- join
- data.str[:5]  #문자열을 잘라낼 수 있다.  

---문자열 있는지 유무-------  
'guido' in val : bool 반환    
data.str.contains('gmail') : bool 반환  

val.index(',') : 찾으면 1을 반환  
val.find(':') : 찾으면 -1을 반환  

----- 문자열 개수 구하기--------  
val.count(',') # 쉼표 개수

## 누락된 데이터 처리하기 
#### pandas객체의 모든 기술 통계는 누락된 데이터를 배제하고 처리한다.
#### pandas에서는 누락된 데이터를 실수값인 NaN으로 취급한다. 이는 누락된 값을 쉽게 찾을 수 있도록 하는 역할을 한다.

In [1]:
import pandas as pd
import numpy as np

float_data = pd.Series([1.2, -3.5, np.nan, 0])
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [3]:
float_data.isna()
# nan값이 있는지 bool 값으로 출력

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data = pd.Series(['aardvak', 'artichoke', np.nan, 'avocado'])
string_data

0      aardvak
1    artichoke
2          NaN
3      avocado
dtype: object

In [6]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

### 누락된 데이터 골라내기

In [7]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data[data.notnull()] #dropna와 동일한 결과

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
data[data.notna()] #dropna와 동일한 결과

0    1.0
2    3.5
4    7.0
dtype: float64

In [16]:
# 이제 NA가 아니고 np.nan으로 해야함.

#DataFRame 객체의 경우 좀 복잡하다. 
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
                   [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [18]:
data.dropna() # nan있는 row 행은 다 날라감.

     0    1    2
0  1.0  6.5  3.0

In [19]:
data.dropna(how='all') #how='all' 모두 NA인 row만 제거한다.

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [20]:
data[4] = np.nan
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [23]:
data[0] # 컬럼출력

0    1.0
1    1.0
2    NaN
3    NaN
Name: 0, dtype: float64

In [25]:
data.iloc[0]
data.loc[0]

0    1.0
1    6.5
2    3.0
4    NaN
Name: 0, dtype: float64

In [30]:
data.dropna(axis=1, how='all')  # 컬럼 4 사라짐.

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

#### DataFrame의 row를 제거하는 방법은 시계열에서 주로 사용된다. 몇개 이상의 값이 들어있는 row를 보고 싶으면 thresh 인자를 사용

In [33]:
df = pd.DataFrame(np.random.randn(7,3))
df.iloc[:4, 1] = np.nan
df.iloc[:2, 2] = np.nan

df

          0         1         2
0 -0.154765       NaN       NaN
1  0.264606       NaN       NaN
2 -1.234025       NaN  2.603296
3 -0.862389       NaN -1.324912
4 -0.626977 -0.454826  0.079712
5  1.090097 -1.650028  1.065408
6  1.048599 -0.946143 -0.217650

In [34]:
df.dropna()

          0         1         2
4 -0.626977 -0.454826  0.079712
5  1.090097 -1.650028  1.065408
6  1.048599 -0.946143 -0.217650

In [37]:
df.dropna(thresh=2) # nan이 최소 2개 이상인것만 출력.

          0         1         2
2 -1.234025       NaN  2.603296
3 -0.862389       NaN -1.324912
4 -0.626977 -0.454826  0.079712
5  1.090097 -1.650028  1.065408
6  1.048599 -0.946143 -0.217650

In [38]:
df.dropna(axis=1, thresh=2)

          0         1         2
0 -0.154765       NaN       NaN
1  0.264606       NaN       NaN
2 -1.234025       NaN  2.603296
3 -0.862389       NaN -1.324912
4 -0.626977 -0.454826  0.079712
5  1.090097 -1.650028  1.065408
6  1.048599 -0.946143 -0.217650

### 결측치 채우기 
#### 누락한 값을 제외시키지 않고 데이터상의 '구멍'을 메우고 싶을때, fillna메소드를 사용한다.

In [39]:
df

          0         1         2
0 -0.154765       NaN       NaN
1  0.264606       NaN       NaN
2 -1.234025       NaN  2.603296
3 -0.862389       NaN -1.324912
4 -0.626977 -0.454826  0.079712
5  1.090097 -1.650028  1.065408
6  1.048599 -0.946143 -0.217650

In [41]:
df.fillna(0) # nan을 0으로 채운다.

          0         1         2
0 -0.154765  0.000000  0.000000
1  0.264606  0.000000  0.000000
2 -1.234025  0.000000  2.603296
3 -0.862389  0.000000 -1.324912
4 -0.626977 -0.454826  0.079712
5  1.090097 -1.650028  1.065408
6  1.048599 -0.946143 -0.217650

In [42]:
df

          0         1         2
0 -0.154765       NaN       NaN
1  0.264606       NaN       NaN
2 -1.234025       NaN  2.603296
3 -0.862389       NaN -1.324912
4 -0.626977 -0.454826  0.079712
5  1.090097 -1.650028  1.065408
6  1.048599 -0.946143 -0.217650

In [44]:
df.fillna({1:0.5,2:0}) # 컬럼 1은 0.5로 채우고 2는 0으로 채운다.

          0         1         2
0 -0.154765  0.500000  0.000000
1  0.264606  0.500000  0.000000
2 -1.234025  0.500000  2.603296
3 -0.862389  0.500000 -1.324912
4 -0.626977 -0.454826  0.079712
5  1.090097 -1.650028  1.065408
6  1.048599 -0.946143 -0.217650

In [45]:
df

          0         1         2
0 -0.154765       NaN       NaN
1  0.264606       NaN       NaN
2 -1.234025       NaN  2.603296
3 -0.862389       NaN -1.324912
4 -0.626977 -0.454826  0.079712
5  1.090097 -1.650028  1.065408
6  1.048599 -0.946143 -0.217650

In [47]:
df.fillna(0, inplace=True)
df

          0         1         2
0 -0.154765  0.000000  0.000000
1  0.264606  0.000000  0.000000
2 -1.234025  0.000000  2.603296
3 -0.862389  0.000000 -1.324912
4 -0.626977 -0.454826  0.079712
5  1.090097 -1.650028  1.065408
6  1.048599 -0.946143 -0.217650

In [49]:
df = pd.DataFrame(np.random.randn(6,3))
df.iloc[2:, 1] = np.nan
df.iloc[4:, 2] = np.nan
df

          0         1         2
0 -0.438344  0.517386  0.132999
1  0.574167  0.555360  1.585671
2 -0.598097       NaN  1.082171
3  0.819913       NaN  0.549550
4  0.235605       NaN       NaN
5 -0.698759       NaN       NaN

In [50]:
obj = pd.Series(['blue', 'purple', 'yellow'], index=[0,2,4])
obj.reindex(range(6), method='ffill') # 앞에꺼 따라 채우기

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [51]:
df.fillna(method='ffill')

          0         1         2
0 -0.438344  0.517386  0.132999
1  0.574167  0.555360  1.585671
2 -0.598097  0.555360  1.082171
3  0.819913  0.555360  0.549550
4  0.235605  0.555360  0.549550
5 -0.698759  0.555360  0.549550

In [52]:
df.fillna(method='bfill')

          0         1         2
0 -0.438344  0.517386  0.132999
1  0.574167  0.555360  1.585671
2 -0.598097       NaN  1.082171
3  0.819913       NaN  0.549550
4  0.235605       NaN       NaN
5 -0.698759       NaN       NaN

In [55]:
df.fillna(method='ffill', limit=2) # 2번만 앞에꺼 따라하기

          0         1         2
0 -0.438344  0.517386  0.132999
1  0.574167  0.555360  1.585671
2 -0.598097  0.555360  1.082171
3  0.819913  0.555360  0.549550
4  0.235605       NaN  0.549550
5 -0.698759       NaN  0.549550

In [56]:
data = pd.Series([1., np.nan, 3.5, np.nan, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [57]:
data.fillna(data.mean()) # 평균값으로 nan 채우기

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [58]:
df.fillna(data.mean())

          0         1         2
0 -0.438344  0.517386  0.132999
1  0.574167  0.555360  1.585671
2 -0.598097  3.833333  1.082171
3  0.819913  3.833333  0.549550
4  0.235605  3.833333  3.833333
5 -0.698759  3.833333  3.833333

In [3]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                    'k2': [1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [4]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [6]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [12]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [14]:
#새로운 컬럼 하나를 추가하고 'k1'컬럼에 기반해 중복을 걸러낸다.
data.drop_duplicates(['k1'])
# one 이랑 two가 중복되니까 초반 하나씩만 출력.

    k1  k2  v1
0  one   1   0
1  two   1   1

In [15]:
data.drop_duplicates(['k1','k2'])

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5

In [17]:
data.drop_duplicates(['k1','k2'], keep='last')
#last옵션은 마지막으로 발견된 값을 반환한다. 
# 5번이 아니고 6번이 출력됨.

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### 함수 또는 매핑을 이용해서 데이터 변경하기 
#### DataFrame의 컬럼이나, Series, 배열 내의 값을 기반으로 데이터의 형태를 변화하고자 할때.

In [18]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                             'Pastrami', 'corned beef', 'Bacon',
                            'pastrami', 'honey ham', 'nova lox'],
                    'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [19]:
#해당 육류가 어떤 동물의 고기인지 알려주는 컬럼을 추가한다고 가정하자.
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [21]:
lowercased = data['food'].str.lower() #데이터에 대소문자 섞여있으므로, 소문자로 변경
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [22]:
#Series의 map 메소드는 사전류의 객체나 어떤 함수를 받을 수 있다.
data['animal'] = lowercased.map(meat_to_animal) #map 메소드 이용
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [23]:
data['food'].map(lambda x: meat_to_animal[x.lower()])
#함수를 넘겨서 같은 일을 수행 가능

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### 값 치환하기 
#### fillna같이 누락된 값을 채우는 일은 일반적인 치환 작업이다. 
#### 위에서 map 메소드를 한 객체안에서 값의 부분집합을 변경하는데 사용하였다.
#### replace 메소드는 같은 작업에 대해 보다 간단하고 유연한 방법을 제공한다.

In [25]:
data = pd.Series([1., -999., 2., -999., 3.])
data

0      1.0
1   -999.0
2      2.0
3   -999.0
4      3.0
dtype: float64

In [26]:
data.replace(-999, np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    3.0
dtype: float64

In [ ]:
#여러개의 값을 치환하려면 값의 리스트를 넘기면 된다.
data.replace([-999,1.0], np.nan)

In [29]:
#치환하려는 값마다 다른 값으로 치환하려면 새로 지정할 리스트를 넘긴다.
data.replace([-999,1.0], [np.nan,0])

0    0.0
1    NaN
2    2.0
3    NaN
4    3.0
dtype: float64

In [31]:
data.replace({-999:np.nan, 3.0:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
dtype: float64

### 축 색인 이름 바꾸기 
#### Series의 값들처럼 축 이름 역시 유사한 방식으로 바꿀 수 있다.

In [32]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),
                   index = ['Ohio', 'Colorado', 'New York'],
                   columns = ['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [38]:
# 대문자 lower, 소문자 : upper
transform = lambda x:x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [48]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [49]:
data.rename(index=str.title, columns=str.upper) 

#원래 객체를 변경하지 않고 새로운 객체를 생성하려면 rename 메소드를 사용한다.
#Series.str.lower : Converts all characters to lowercase. 소문자로
#Series.str.upper : Converts all characters to uppercase. 대문자로
#Series.str.title : Converts first character of each word to uppercase and remaining to lowercase. 맨앞만대문자
#Series.str.capitalize :Converts first character to uppercase and remaining to lowercase.띄어쓰기 기준으로 단어 맨앞대문자
#Series.str.swapcase :Converts uppercase to lowercase and lowercase to uppercase.

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

칼럼, 인덱스 column index 이름 바꾸기 :rename  
(1) pandas DataFrame의 칼럼 이름 바꾸기  
    :  df.columns = ['a', 'b']  
    :  df.rename(columns = {'old_nm' : 'new_nm'}, inplace = True)  
(2) pandas DataFrame의 인덱스 이름 바꾸기  
    : df.index = ['a', 'b']  
    : df.rename(index = {'old_nm': 'new_nm'}, inplace = True)

In [50]:
data.rename(index={'OHIO':"INDIANA"},
           columns = {'three':'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [51]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [52]:
#rename 메소드를 사용하면 DataFrame을 직접 복사해서 index와 column 속성을 갱신할 필요없이 바로 변경 가능
#원본 데이터를 바로 변경하려면, inplace=True 옵션을 사용하면 된다.
data.rename(index={'OHIO': 'INDIANA'}, inplace=True) 
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [53]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

### 개별화와 양자화 
#### 연속성 데이터는 종종 개별로 분할 하거나 아니면 분석을 위해 그룹별로 나누기도 한다.

In [59]:
#수업에 참여하는 학생 그룹 데이터가 있고, 나이에 따라 분류한다고 가정하자.
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]

cats = pd.cut(ages, bins) 
#cut 함수를 이용해서 18-25, 26-35, 36-60, 61-100 그룹으로 나눈다.
#pandas에서 반환하는 객체는 Categorical이라는 특수한 객체이다. 이 객체는 그룹 이름이 담긴 배열이라고 생각하면 된다. 
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [56]:
cats.codes #4개의 categories중 어디에 속하는지 표시

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [57]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [60]:
cats.categories[0]

Interval(18, 25, closed='right')

In [61]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [62]:
#labels 옵션을 사용해서 그룹의 이름을 직접 넘겨줄 수도 있다. 
group_names = ['Youth', 'YoungAdult', 'MiddleAges', 'Senior']
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAges', 'MiddleAges', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAges' < 'Senior']

In [63]:
#어떤 균등분포에서 4개의 그룹으로 나누는 경우
data = np.random.rand(20)
data

array([0.5599384 , 0.91860417, 0.36792986, 0.66118564, 0.61308375,
       0.34623043, 0.50869825, 0.6856694 , 0.53422857, 0.93326137,
       0.72999238, 0.49822104, 0.28842819, 0.83120965, 0.54759209,
       0.52106313, 0.63543517, 0.25608372, 0.24729252, 0.69549582])

### 특이값(outlier) 검출 및 제외

In [64]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.007020     0.005978    -0.031247    -0.007423
std       1.023984     0.999629     1.008691     0.988166
min      -3.164427    -3.315671    -2.780962    -3.595619
25%      -0.719356    -0.654764    -0.759597    -0.654824
50%       0.003672    -0.012458    -0.029514    -0.029188
75%       0.723385     0.712643     0.685155     0.679113
max       3.358622     2.935264     3.302008     3.408802

In [65]:
data

            0         1         2         3
0   -0.788055 -0.810835 -0.654670 -0.161209
1    0.239200 -0.532823 -0.223220  0.576556
2    0.083450 -0.562238  0.848160 -0.466196
3   -0.455560 -0.545109  0.692009 -0.143300
4   -0.124749 -2.853044 -1.011502  0.104511
..        ...       ...       ...       ...
995  1.013214 -0.291116 -0.558766  0.670116
996 -0.142456 -0.664225 -0.962817 -0.602707
997 -0.298839  1.153583  0.344132  0.167494
998 -1.009684  0.833774  0.086626  0.360563
999 -0.076072 -0.781912  1.233297  1.437548

[1000 rows x 4 columns]

In [68]:
col = data[2]
col[col.abs() > 3] 
#DataFrame의 특정 한 컬럼(data[2])에서 3을 초과하는 값을 찾는 경우

481    3.151219
505    3.302008
Name: 2, dtype: float64

In [71]:
data[(np.abs(data) > 3).any(axis='columns')] 
#3을 초과하는 모든 row를 선택하려면 any 메소드를 사용

            0         1         2         3
215  3.146396  1.001828 -0.061808  0.786883
321 -3.137141  1.261199 -0.104790 -0.182762
326 -1.781417 -3.186710  0.033461  0.959066
346  3.136503 -1.614542  1.269946 -0.613698
396  3.358622  1.351006 -0.210573  0.034624
481  1.998866 -0.345663  3.151219  0.449713
505 -2.994622  0.125604  3.302008 -0.382799
562  0.055095  0.860907 -0.724508 -3.578504
564 -3.164427  1.476772  0.446382  0.651738
636  1.247334  0.411085 -0.608251  3.408802
786 -0.137793 -3.275602 -1.081031 -1.991372
810 -0.782488 -3.315671 -0.141448 -0.101753
956 -0.440711  0.626039  1.178286 -3.595619

### 확장 데이터 유형 
#### pandas는 numpy 기반으로 만들어 졌다. numpy 기반으로 인해 미묘한 문제가 발생할 수 있다. 
#### 이를 위해 pandas "확장 데이터 유형"을 제공한다.  
#### 표 7-3 참조

In [73]:
s = pd.Series([1,2,3,None])
s.dtype

dtype('float64')

In [81]:
s = pd.Series([1,2,3,None], dtype=pd.Int64Dtype()) # int로 변경
s.dtype

Int64Dtype()

In [79]:
s[3] is pd.NA

True

In [80]:
s = pd.Series([1, 2, 3, None], dtype="Int64") 
#Int64Dtype 대신에 Int64 사용가능(대문자 주의) 
s.dtype

Int64Dtype()

In [82]:
s = pd.Series(['one', 'two', None, 'three'], dtype=pd.StringDtype())
s

0      one
1      two
2     <NA>
3    three
dtype: string

In [84]:
df = pd.DataFrame({"A": [1, 2, None, 4],
                   "B": ["one", "two", "three", None],
                   "C": [False, None, False, True]})
df

     A      B      C
0  1.0    one  False
1  2.0    two   None
2  NaN  three  False
3  4.0   None   True

In [85]:
df["A"] = df["A"].astype("Int64")
df["B"] = df["B"].astype("string")
df["C"] = df["C"].astype("boolean")
df

      A      B      C
0     1    one  False
1     2    two   <NA>
2  <NA>  three  False
3     4   <NA>   True

### 문자열 객체 메소드 
#### 문자열을 다루어야 하는 대부분의 에플리케이션은 내장 문자열 메소드만으로도 충분하다.

In [86]:
val = 'a,b,   guido'
val.split(',')
#,로 구분된 문자열은 split 메소드를 이용해 분리

['a', 'b', '   guido']

In [88]:
val.split(' ')

['a,b,', '', '', 'guido']

#### 양 끝 공백 제거 : .strip()
#### 왼쪽 공백 제거 : .lstrip()
#### 오른쪽 공백 제거 : .rstrip()

In [89]:
pieces = [x.strip()for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [95]:
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [96]:
'::'.join(pieces)
#위의 방법보다 편리하고 파이썬스러운 방법, 리스트나 튜플을 ::문자열의 join메소드로 전달하는것이다.

'a::b::guido'

#### 일치하는 부분문자열의 위치를 찾는 방법도 있다. index나 find를 사용하는것도 가능하지만 
#### 파이썬의 in 예약어를 사용하면 일치하는 문자열을 쉽게 찾을 수 있다.

In [97]:
'guido' in val

True

In [98]:
val.index(',')

1

In [100]:
val.find(':')

-1

In [101]:
val.count(',') # 쉼표 개수

2

In [102]:
val.replace(',','::')

'a::b::   guido'

### 벡터화된 문자열 함수

In [103]:
import pandas as pd
import numpy as np
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [104]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [105]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [106]:
values = pd.Series(['apple', 'orange', 'apple',
                    'apple'] * 2)
values

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
dtype: object

In [107]:
pd.unique(values)

array(['apple', 'orange'], dtype=object)

In [108]:
pd.value_counts(values)

apple     6
orange    2
dtype: int64

In [109]:
values = pd.Series([0, 1, 0, 0] * 2)
dim = pd.Series(['apple', 'orange'])

In [110]:
dim.take(values)
#take 메서드를 사용하면, Series에 저장된 원래 문자열을 구할 수 있다. 
# 이러한 표현을 범주형 표기법이라 한다.

0     apple
1    orange
0     apple
0     apple
0     apple
1    orange
0     apple
0     apple
dtype: object

## 정규표현식

In [1]:
import re

text = "foo bar\t baz   \tqux" 
#여러가지 공백문자(탭, 스페이스, 개행문자)가 포함된 문자열
text

'foo bar\t baz   \tqux'

In [3]:
re.split('\s+', text)   #'\s+'는 하나 이상의 공백문자(스페이스, 탭)를 의미한다.
#정규 표현식이 먼저 컴파일되고, 그 다음 split 메서드가 실행된다.

['foo', 'bar', 'baz', 'qux']

In [4]:
regex = re.compile('\s+') #먼저 컴파일
regex.split(text)         #정규표현식 객체 재사용

['foo', 'bar', 'baz', 'qux']

In [6]:
regex.findall(text)
#정규 표현식에 매칭되는 모든 패턴의 목록을 얻고 싶다면 findall 메소드 사용

[' ', '\t ', '   \t']

#### match와 search는 findall 메서드와 관련이 있다.
#### findall : 문자열에서 일치하는 모든 부분 문자열을 찾아준다. 
#### search : 패턴과 일치하는 첫 번째 존재를 반환한다. 
#### match : 문자열의 시작부분에서 일치하는 것만 찾아준다 
#### sub : 찾은 패턴을 주어진 문자열로 치환하여 새로운 문자열을 반환

In [7]:
#이메일 주소를 검사하는 정규 표현식
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
jwseok@changwon.ac.kr
"""

pattern = r"[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}"
regex = re.compile(pattern, flags=re.IGNORECASE) 
#re.IGNORECASE는 정규 표현식이 대소문자를 가리지 않도록 한다.

In [9]:
regex.findall(text) #이메일 주소와 일치하는 모든 부분 문자열을 찾아준다

['dave@google.com',
 'steve@gmail.com',
 'rob@gmail.com',
 'ryan@yahoo.com',
 'jwseok@changwon.ac.kr']

In [11]:
m = regex.search(text)
m

In [13]:
text[m.start():m.end()]
#정규 표현식에 매칭된 첫 번째 이메일 주소를 포함하는 부분 문자열을 의미합니다.

'dave@google.com'

In [14]:
print(regex.match(text)) #문자열의 시작부분에서 일치하는 것

None

In [17]:
r = re.compile("[ab]")
print(r.search("pizza"))
print(r.match("pizza"))  #문자열의 시작부분에서 일치하는 것
print(r.match("abcd"))

<re.Match object; span=(4, 5), match='a'>
None
<re.Match object; span=(0, 1), match='a'>

In [18]:
print(regex.sub('REDACTED',text))
#sub 메소드는 찾은 패턴을 주어진 문자열로 치환하여 새로운 문자열을 반환한다.

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED
REDACTED

In [19]:
#이메일 주소를 각 콤포논트별(사용자이름, 도메인이름, 도메인접미사)로 나누어야 한다면, 각 패턴을 괄호로 묶어준다.
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})' 
regex = re.compile(pattern, flags=re.IGNORECASE)

In [20]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com'),
 ('jwseok', 'changwon.ac', 'kr')]

In [21]:
m = regex.match('wes@bright.net')
m.groups()  #group메서드로 각 패넌 컴포넌트의 튜플을 얻을 수 있다.

('wes', 'bright', 'net')

In [22]:
#sub 은 \1, \2와 같은 특수한 기호를 사용하여 각 패턴그룹에 접근할 수 있다.
#\1은 첫 번째, \2는 두 번째 그룹을 의미한다.
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com
Username: jwseok, Domain: changwon.ac, Suffix: kr

In [23]:
import pandas as pd
import numpy as np
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [24]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

문자열고 정규표현식 메서는 data.map을 사용  

하지만, NA 값을 만나면 실패하게 된다.

이 경우 Series에서는 str속성을 이용해서 처리한다.

정규표현식을 'IGNORECASE' 같은 re 옵션과 함께 사용하는 것도 가능하다.

In [25]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [26]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [27]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

## Vector에서 요소 검색:
"Vector"라는 자료 구조에서 요소를 가져오기 위해서는 'str.get' 메서드 또는 인덱스를 사용할 수 있습니다.

## 내장된 리스트의 요소에 접근: 
Vector 안에 내장된 리스트에 접근하기 위해서도 'str.get' 메서드나 인덱스를 사용합니다.

## 문자열 슬라이싱: 
이 구문을 사용하여 문자열을 슬라이스할 수 있습니다. 슬라이싱은 문자열에서 일부분을 선택하는 것을 의미합니다.

In [28]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [29]:
data.str[:5]  #문자열을 잘라낼 수 있다.

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object